app/views/tasks/create.js.erb

alert('task created');
document.getElementById("<%= @task.category.id%>").insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>");
---
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-29 07:33:20.204655"], ["updated_at", "2019-08-29 07:33:20.204655"], ["title", "THP5"], ["deadline", "2019-08-30 00:00:00"], ["category_id", 2]]