app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-08-30 14:08:08.380576"], ["id", 3]]
---
	def show
		@email = Email.find(params[:id])

		@email.update(read: true)

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
	def create
	  	@email = Email.create!(object: Faker::Book.title,body: Faker::Lorem.paragraph)

SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2019-08-30 14:25:49.179333"], ["id", 5]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-08-30 14:04:36.926999"], ["id", 2]]
---
	def update
	    @email = Email.find(params[:id])


	    if @email.read == true
	    	@email.update(read: false)
	    else
	    	@email.update(read: true)