app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = $1, "status" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2019-08-29 11:34:18.336649"], ["status", true], ["id", 79]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", false], ["updated_at", "2019-08-30 05:59:23.654728"], ["id", 16]]
---
  def update
    @task = Task.find(params[:id])
    @task.update(task_params)

    value = params[:value]
    if value.to_i == 1
      @task.status = true
    else
      @task.status = false
    end
    if @task.save