app/views/emails/create.js.erb

alert("email created");
document.getElementById("email").insertAdjacentHTML("beforeend", "<%= j render 'email', email: @email %>");
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"